Documents/УправлениеСоставомЖильцов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УправлениеСоставомЖильцов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СобственникиОбектовЛицевыхСчетов</xr:Item>
				<xr:Item>InformationRegister.СведенияОПрописанныхЖильцах</xr:Item>
				<xr:Item>InformationRegister.СведенияОПроживающихЖильцах</xr:Item>
				<xr:Item>InformationRegister.СтепеньРодстваФизическихЛиц</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Жильцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Жилец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Собственник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляСобственности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияДействияПрописки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияПериодаПроживания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньРодства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыРодственныхСвязей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прописан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проживает</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаПроживания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДокументыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ДокументыФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяДокументомУдостоверяющимЛичность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УправлениеСоставомЖильцов/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
		
	ОтветственныйВладелецПред = ПолучитьОтветственногоВладельца(Объект.ЛицевойСчет);
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	Оповестить("ИзмененЛицевойСчет", Объект.ЛицевойСчет , ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция возвращает ответственного владельца лицевого счета.
//
&НаСервереБезКонтекста
Функция ПолучитьОтветственногоВладельца(ЛицевойСчет)
	
	Если НЕ ЗначениеЗаполнено(ЛицевойСчет) Тогда
		Возврат Справочники.ПотребителиУслуг.ПустаяСсылка();
	КонецЕсли;
	
	ТаблицаОтветственныйВладелец = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(), Новый Структура("ЛицевойСчет", ЛицевойСчет));
	
	Если ТаблицаОтветственныйВладелец.Количество() > 0 Тогда
		Возврат ТаблицаОтветственныйВладелец[0].ОтветственныйВладелец;
	Иначе
		Возврат Справочники.ПотребителиУслуг.ПустаяСсылка();
	КонецЕсли;
		
КонецФункции

// Процедура - обработчик команды "документыФизЛиц".
//
&НаКлиенте
Процедура КомандаДокументыФизЛиц(Команда)
	
	Если Элементы.Жильцы.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФизЛицо = Элементы.Жильцы.ТекущиеДанные.Жилец;
	Если НЕ ЗначениеЗаполнено(ФизЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("ФизЛицо", ФизЛицо);
	ПараметрыФизЛицо = Новый Структура("Отбор",СтруктураОтбора);
	ОткрытьФорму("РегистрСведений.ДокументыФизическихЛиц.Форма.ДокументыФизическогоЛица", ПараметрыФизЛицо);
	
КонецПроцедуры

// Функция возвращает ответственного владельца лицевого счета.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеЛицевойСчетПриИзменении(ЛицевойСчет)
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить("Организация", ЛицевойСчет.Владелец.Организация);
	СтруктураДанные.Вставить("Здание", ЛицевойСчет.Владелец);

	
	Если НЕ ЗначениеЗаполнено(ЛицевойСчет) Тогда
		
		СтруктураДанные.Вставить("ОтветственныйВладелец", Справочники.ПотребителиУслуг.ПустаяСсылка());
		
		Возврат СтруктураДанные;
		
	КонецЕсли;
	
	ТаблицаОтветственныйВладелец = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ТекущаяДата(), Новый Структура("ЛицевойСчет", ЛицевойСчет));
	
	Если ТаблицаОтветственныйВладелец.Количество() > 0 Тогда
		СтруктураДанные.Вставить("ОтветственныйВладелец", ТаблицаОтветственныйВладелец[0].ОтветственныйВладелец);
	Иначе
		СтруктураДанные.Вставить("ОтветственныйВладелец", Справочники.ПотребителиУслуг.ПустаяСсылка());
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеЛицевойСчетПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода "ЛицевойСчет".
//
&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	СтруктураДанные = ПолучитьДанныеЛицевойСчетПриИзменении(Объект.ЛицевойСчет);
	
	Объект.Организация = СтруктураДанные.Организация;
	Объект.Здание = СтруктураДанные.Здание;
	ОтветственныйВладелецПред = СтруктураДанные.ОтветственныйВладелец;
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "ЛицевойСчет".
//
&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораЗначения = Новый Структура;
	ПараметрыВыбораЗначения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыВыбораЗначения.Вставить("ОтборЗдание",			Объект.Здание);

	ОткрытьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораСОтбором", ПараметрыВыбораЗначения, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖильцыСобственникПриИзменении(Элемент)
	
	Строка = Элементы.Жильцы.ТекущиеДанные;
	Если Строка.Собственник = Ложь Тогда
		
		Строка.ДоляСобственности ="";

	КонецЕсли;	

	
КонецПроцедуры

&НаКлиенте
Процедура ЖильцыПрописанПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Жильцы.ТекущиеДанные;
	Если ТекущиеДанные.Прописан = Ложь Тогда
		ТекущиеДанные.ДатаНачалаДействия = '00010101';
		ТекущиеДанные.ДатаОкончанияДействияПрописки = '00010101'; 
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЖильцыПроживаетПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Жильцы.ТекущиеДанные;
	Если ТекущиеДанные.Проживает = Ложь Тогда
		ТекущиеДанные.ДатаНачалаПроживания = '00010101';
		ТекущиеДанные.ДатаОкончанияПериодаПроживания = '00010101';
	КонецЕсли;
	
КонецПроцедуры
